{
  "architectures": ["GlmMoeDsaForCausalLM"],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_glm.GlmMoeDsaConfig",
    "AutoModel": "modeling_glm.GlmMoeDsaModel",
    "AutoModelForCausalLM": "modeling_glm.GlmMoeDsaForCausalLM"
  },
  "first_k_dense_replace": 1,
  "hidden_act": "silu",
  "hidden_size": 512,
  "index_head_dim": 64,
  "index_n_heads": 8,
  "index_topk": 32,
  "indexer_rope_interleave": true,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "kv_lora_rank": 512,
  "max_position_embeddings": 8192,
  "model_type": "glm_moe_dsa",
  "moe_intermediate_size": 256,
  "moe_layer_freq": 1,
  "n_group": 1,
  "n_routed_experts": 32,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 8,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 4,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "q_lora_rank": 128,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-05,
  "rope_interleave": true,
  "rope_parameters": {
    "rope_type": "default",
    "rope_theta": 10000
  },
  "rope_theta": 10000,
  "indexer_types": ["full", "full", "full", "full"],
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "v_head_dim": 64,
  "vocab_size": 32000
}
